import random

print("欢迎来到百万大奖赛节目现场，有请我们今天的挑战者！就是电脑前的你")

door = random.randint(1,3)

door1 = int(input("请从1至3，3个门中选择一个门:\n"))

print("好。看起来我们的挑战者已经做出了他的选择，\n不过现在不是揭晓答案的时候，我们先打开另外两扇门的一扇^_^")

if door1 == 1:
    if door == 1:
        print('我们来展示挑战者没有选择的2门！')
        print('结果是---------------羊！\n那么挑战者，你需要换另一扇门吗?')
        c = int(input("请选择：(1:换 2：不换)\n"))
        if c == 1:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("哦~~~真是太遗憾了，不过没关系，我们还有明天的选择机会。")
        else:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("让我们恭喜这位挑战者！他获取了本期节目的大奖，那就是布加迪威龙！")
    if door == 2:
        print('我们来展示挑战者没有选择的3门！')
        print('结果是---------------羊！\n那么挑战者，你需要换另一扇门吗?')
        c = int(input("请选择：(1:换 2：不换)\n"))
        if c == 1:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("让我们恭喜这位挑战者！他获取了本期节目的大奖，那就是布加迪威龙！")
        else:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("哦~~~真是太遗憾了，不过没关系，我们还有明天的选择机会。")
    if door == 3:
        print('我们来展示挑战者没有选择的2门！')
        print('结果是---------------羊！\n那么挑战者，你需要换另一扇门吗?')
        c = int(input("请选择：(1:换 2：不换)\n"))
        if c == 1:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("让我们恭喜这位挑战者！他获取了本期节目的大奖，那就是布加迪威龙！")
        else:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("哦~~~真是太遗憾了，不过没关系，我们还有明天的选择机会。")
if door1 == 2:
    if door == 1:
        print('我们来展示挑战者没有选择的3门！')
        print('结果是---------------羊！\n那么挑战者，你需要换另一扇门吗?')
        c = int(input("请选择：(1:换 2：不换)\n"))
        if c == 1:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("让我们恭喜这位挑战者！他获取了本期节目的大奖，那就是布加迪威龙！")
        else:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("哦~~~真是太遗憾了，不过没关系，我们还有明天的选择机会。")
    if door == 2:
        print('我们来展示挑战者没有选择的3门！')
        print('结果是---------------羊！\n那么挑战者，你需要换另一扇门吗?')
        c = int(input("请选择：(1:换 2：不换)\n"))
        if c == 1:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("哦~~~真是太遗憾了，不过没关系，我们还有明天的选择机会。")
        else:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("让我们恭喜这位挑战者！他获取了本期节目的大奖，那就是布加迪威龙！")
    if door == 3:
        print('我们来展示挑战者没有选择的1门！')
        print('结果是---------------羊！\n那么挑战者，你需要换另一扇门吗?')
        c = int(input("请选择：(1:换 2：不换)\n"))
        if c == 1:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("让我们恭喜这位挑战者！他获取了本期节目的大奖，那就是布加迪威龙！")
        else:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("哦~~~真是太遗憾了，不过没关系，我们还有明天的选择机会。")
if door1 == 3:
    if door == 1:
        print('我们来展示挑战者没有选择的2门！')
        print('结果是---------------羊！\n那么挑战者，你需要换另一扇门吗?')
        c = int(input("请选择：(1:换 2：不换)\n"))
        if c == 1:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("让我们恭喜这位挑战者！他获取了本期节目的大奖，那就是布加迪威龙！")
        else:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("哦~~~真是太遗憾了，不过没关系，我们还有明天的选择机会。")
    if door == 2:
        print('我们来展示挑战者没有选择的1门！')
        print('结果是---------------羊！\n那么挑战者，你需要换另一扇门吗?')
        c = int(input("请选择：(1:换 2：不换)\n"))
        if c == 1:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("让我们恭喜这位挑战者！他获取了本期节目的大奖，那就是布加迪威龙！")
        else:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("哦~~~真是太遗憾了，不过没关系，我们还有明天的选择机会。")
    if door == 3:
        print('我们来展示挑战者没有选择的2门！')
        print('结果是---------------羊！\n那么挑战者，你需要换另一扇门吗?')
        c = int(input("请选择：(1:换 2：不换)\n"))
        if c == 1:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("哦~~~真是太遗憾了，不过没关系，我们还有明天的选择机会。")
        else:
            print("那么们后面的究竟是百万豪车还是羊呢？")
            print("让我们来揭晓吧")
            print("让我们恭喜这位挑战者！他获取了本期节目的大奖，那就是布加迪威龙！")